App({
  globalData: {
    BaseData: [{
      "id": 786,
      "sex": 1,
      "content": "我今年23岁，老家在安徽，目前在北京工作，独立、善良、孝顺都是我的优点。比较喜欢有担当，有主见的男生，如果他再有点小幽默就更好了，还有身高不要低于175cm。如果有合适的小哥哥，我么可以聊聊啊~"
    }, {
      "id": 854,
      "sex": 1,
      "content": "我是山东人，现在在上海工作，在异乡漂泊真的很孤独，很想有个人能陪伴我。过完年我就27岁了，性格比较内向，想找一个能读懂我内心的人，哪儿人都可以，年龄不要相差太大，奔着结婚去的，我很真诚，希望你也能够认真真诚。"
    }, {
      "id": 1022,
      "sex": 1,
      "content": "年芳27湖南人氏"
    }, {
      "id": 1103,
      "sex": 1,
      "content": "我是广东的妹子，喜欢旅游，性感比较开朗，想找个顾家，宠老婆，又东浪漫的男朋有，希望在着遇到有缘人～"
    }, {
      "id": 1005,
      "sex": 0,
      "content": "本人男，30岁了，北京人，有车有房，想找个漂亮的四川妹子，聊聊看"
    }, {
      "id": 1214,
      "sex": 1,
      "content": "湖北人 在北京工作。今年27 我是你的前女友 也曾拯救过地球 身高刚好169 快来找我复合吧。我不是颜控 喜欢有才华 有爱心 幽默的男生，身高175以上。理想型 李诞 一样的诗人\uD83D\uDC7B"
    }, {
      "id": 1207,
      "sex": 1,
      "content": "我今年25岁，是来自东北的妹子。平时喜欢美食、看书，想找一个178cm以上，白白净净的男生。"
    }, {
      "id": 1227,
      "sex": 1,
      "content": "我是川妹子今年23岁~目前在北京打工，做酒店行业的，平时除了工作一个人比较孤单，想找个聊得来的小哥哥，一起回家过年"
    }, {
      "id": 1206,
      "sex": 1,
      "content": "我是河北人，目前在北京工作，刚毕业，想找个有稳定工作的男朋友，颜值不必很高，有眼缘就行，但是一定要有责任心，奔着结婚去的，非诚勿扰哈～"
    }, {
      "id": 799,
      "sex": 0,
      "content": "我是江西男孩。今年28岁，在一个公司上班。找一个温柔体贴的女"
    }, {
      "id": 859,
      "sex": 0,
      "content": "湖南人在广州，找个过圣诞的妹子，最好以后每个圣诞一起过！"
    }, {
      "id": 825,
      "sex": 0,
      "content": "我26，云南，哈哈！是个人就行。"
    }, {
      "id": 861,
      "sex": 0,
      "content": "江苏人现居上海1，28，171，54。喜欢可爱的女孩，求勾搭"
    }, {
      "id": 862,
      "sex": 0,
      "content": "江苏人现居上海2，28，171，54。喜欢可爱的女孩，求勾搭"
    }, {
      "id": 863,
      "sex": 0,
      "content": "江苏人现居上海3，28，171，54。喜欢可爱的女孩，求勾搭"
    }, {
      "id": 864,
      "sex": 0,
      "content": "江苏人现居上海4，28，171，54。喜欢可爱的女孩，求勾搭"
    }, {
      "id": 865,
      "sex": 0,
      "content": "江苏人现居上海5，28，171，54。喜欢可爱的女孩，求勾搭"
    }, {
      "id": 866,
      "sex": 0,
      "content": "江苏人现居上海6，28，171，54。喜欢可爱的女孩，求勾搭"
      }, {
        "id": 2000,
        "sex": 1,
        "content": "江苏人现居上海2000，28，171，54。喜欢可爱的女孩，求勾搭"
      }, {
        "id": 2001,
        "sex": 1,
        "content": "江苏人现居上海2001，28，171，54。喜欢可爱的女孩，求勾搭"
      }, {
        "id": 2002,
        "sex": 1,
        "content": "江苏人现居上海2002，28，171，54。喜欢可爱的女孩，求勾搭"
      }, {
        "id": 2003,
        "sex": 1,
        "content": "江苏人现居上海2003，28，171，54。喜欢可爱的女孩，求勾搭"
      }, {
        "id": 2004,
        "sex": 0,
        "content": "江苏人现居上海2004，28，171，54。喜欢可爱的女孩，求勾搭"
      }, {
        "id": 2005,
        "sex": 1,
        "content": "江苏人现居上海2005，28，171，54。喜欢可爱的女孩，求勾搭"
      }, {
        "id": 2006,
        "sex": 0,
        "content": "江苏人现居上海2006，28，171，54。喜欢可爱的女孩，求勾搭"
      }, {
        "id": 2007,
        "sex": 1,
        "content": "江苏人现居上海2007，28，171，54。喜欢可爱的女孩，求勾搭"
      }, {
        "id": 2008,
        "sex": 0,
        "content": "江苏人现居上海2009，28，171，54。喜欢可爱的女孩，求勾搭"
      }
    ],
    AvatarBoy: '/assets/icon_avatar_boy.png',
    AvatarGirl: '/assets/icon_avatar_girl.png',
    IconBoy: '/assets/icon-boy.png',
    IconGirl: '/assets/icon-girl.png'
  },

  /**
   * 当小程序初始化完成时，会触发 onLaunch（全局只触发一次）
   */
  onLaunch: function () {
  },

  /**
   * 当小程序启动，或从后台进入前台显示，会触发 onShow
   */
  onShow: function (options) {
    
  },

  /**
   * 当小程序从前台进入后台，会触发 onHide
   */
  onHide: function () {
    
  },

  /**
   * 当小程序发生脚本错误，或者 api 调用失败时，会触发 onError 并带上错误信息
   */
  onError: function (msg) {
    console.log(msg)
  }
})
